app/controllers/dashboards_controller.rb

SELECT "users".* FROM "users" ORDER BY id ASC
---
  def index
    authorize! :index, @users
    @users = User.all.order("id ASC")

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 36], ["LIMIT", 1]]
---
  def edit_user
    @user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 36], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 26]]
---
  def delete_user
    @user = User.find(params[:id])
    authorize! :index, @user
    @user.destroy