app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Post 1"], ["content", "Holaaaa"], ["user_id", 1], ["created_at", "2019-09-06 23:38:38.866314"], ["updated_at", "2019-09-06 23:38:38.866314"]]
---
  def create
    @post = Post.new(post_params)
    @post.user = current_user

    respond_to do |format|
      if @post.save